cases/regular/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

motionSolverLibs    (sixDoFRigidBodyMotion);

dynamicFvMesh       dynamicMotionSolverFvMesh;

solver          sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{

    patches         (float);
    innerDistance   10;
    outerDistance   40.0;

    centreOfMass    (0.0 0.0 -9.893); // HOLLOW: replace with verified hollow centre of mass; see README §Base-to-hollow conversion.
    
    mass            1.37E7; // HOLLOW: replace with verified hollow total mass; see README §Base-to-hollow conversion.

    // Cuboid moment of inertia about the centre of mass
    momentOfInertia (1.3813E10 1.3813E10 1.2287E10); // HOLLOW: replace with verified hollow inertia tensor.

    rho             rhoInf;
    rhoInf          1025;

    report          on;
    accelerationRelaxation 0.6;
    accelerationDamping    0.9;;

    solver
    {
        type CrankNicolson;//Newmark;
    }

    constraints
    {

        
        /*fixedPoint
        {
             sixDoFRigidBodyMotionConstraint point;
             centreOfRotation (0.5 0.45 0.1);
        }*/
        

        fixedLine
        {
            sixDoFRigidBodyMotionConstraint line;
            //centreOfRotation (0.5 0.45 0.1);
            direction (0 0 1);
        }

        
        fixedAxis
        {
            sixDoFRigidBodyMotionConstraint axis;
            axis (0 1 0);
        }
        
        /*moorDynR1
		{
			sixDoFRigidBodyMotionRestraint moorDynR1;
		}*/
    }
    
    restraints
	{
		verticalSpring
		{
			sixDoFRigidBodyMotionRestraint linearSpring;

			anchor          (0 0 -9.893);
			refAttachmentPt (0 0 -9.893);
			stiffness       3745330;
			damping         716317;
			restLength      0;
		}

    
	}
}


// ************************************************************************* //
